# 解答例1
print(int(input()) * 100)

# 解答例2
print(input() + "00")

'''
パワー 100 倍 (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/forest_contest_004/forest_contest_004__power_up
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
あなたが作っているゲームでは、栄養ドリンクを飲むと攻撃力が一時的に 100 倍になります。

現在の攻撃力が与えられるので、栄養ドリンクを飲んだ後の攻撃力がいくつになるかを求めてください。

▼ 下記解答欄にコードを記入してみよう

入力される値
p

・ 1 行目に、現在の攻撃力 p が整数で与えられます。

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
栄養ドリンクを飲んだ後の攻撃力を求め、1 行に出力してください。

条件
・ 1 ≦ p ≦ 10^1000

入力例1
813

出力例1
81300

入力例2
123456789012345678901234567890

出力例2
12345678901234567890123456789000
'''
