=begin
約数の列挙 (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/loop_problems2/loop_problems2__divsor_print
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
整数 N が与えられます。
N の約数を小さい方から順に改行区切りで出力してください。

▼　下記解答欄にコードを記入してみよう

入力される値
N


・ 1 行で整数 N が与えられます。

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
N の約数を小さい方から順に改行区切りで出力してください。

条件
すべてのテストケースにおいて、以下の条件をみたします。

・ 1 ≦ N ≦ 1,000

入力例1
10

出力例1
1
2
5
10

入力例2
100

出力例2
1
2
4
5
10
20
25
50
100

入力例3
1000

出力例3
1
2
4
5
8
10
20
25
40
50
100
125
200
250
500
1000
=end