=begin
階乗の末尾に 0 はいくつ付く？ (paizaランク C 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/loop_problems2/loop_problems2__factorial_zero
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
整数 N が与えられます。
N の階乗 N! の末尾に 0 がいくつ付くか求め、出力してください。

▼　下記解答欄にコードを記入してみよう

入力される値
N


・ 1 行で整数 N が与えられます。

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
N の階乗 N! の末尾に 0 がいくつ付くか求め、出力してください。

条件
すべてのテストケースにおいて、以下の条件をみたします。

・ 100 ≦ N ≦ 1,000

入力例1
100

出力例1
24

入力例2
300

出力例2
74

入力例3
500

出力例3
124
=end