=begin
10 進数から M 進数に変換 (paizaランク C 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/loop_problems2/loop_problems2__conv_nbase
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
10 進数で表された整数 N, M が与えられます。
N を M 進数に変換して出力してください。

▼　下記解答欄にコードを記入してみよう

入力される値
N M


・ 1 行で整数 N, M が与えられます。

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
N を M 進数に変換して出力してください。

条件
すべてのテストケースにおいて、以下の条件をみたします。

・ 1 ≦ N ≦ 100
・ 2 ≦ M ≦ 10

入力例1
10 2

出力例1
1010

入力例2
10 8

出力例2
12

入力例3
10 5

出力例3
20
=end