=begin
1 はどこにある？ (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/loop_problems2/loop_problems2__seq_one
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
N 個の整数 a_1, a_2, ..., a_N が与えられます。
a_1, a_2, ..., a_N のうち、1 がある位置を先頭から順に改行区切りで出力してください。
a_1 を 1 番目とし、a_1, a_2, ..., a_N には少なくとも 1 個は 1 が含まれます。

▼　下記解答欄にコードを記入してみよう

入力される値
N
a_1 a_2 ... a_N


・ 1 行目に整数 N が与えられます。
・ 2 行目に N 個の整数 a_1, a_2, ..., a_N が与えられます。
・ a_1, a_2, ..., a_N には少なくとも 1 個は 1 が含まれます。

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
a_1, a_2, ..., a_N のうち、1 がある位置を先頭から順に改行区切りで出力してください。

条件
すべてのテストケースにおいて、以下の条件をみたします。

・ 1 ≦ N ≦ 100
・ 1 ≦ a_i ≦ 100

入力例1
5
5 3 1 3 5

出力例1
3

入力例2
5
1 5 5 5 1

出力例2
1
5

入力例3
5
1 1 1 1 1

出力例3
1
2
3
4
5
=end