=begin
加算された数列の最小値 (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/loop_problems2/loop_problems2__add_minseq
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
N 個の整数 a_1, a_2, ..., a_N が与えられます。
a_i に i を足したとき、N 個の整数の最小値を出力してください。

▼　下記解答欄にコードを記入してみよう

入力される値
N
a_1 a_2 ... a_N


・ 1 行目に整数 N が与えられます。
・ 2 行目に N 個の整数 a_1, a_2, ..., a_N が与えられます。

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
a_i に i を足したとき、N 個の整数の最小値を出力してください。

条件
すべてのテストケースにおいて、以下の条件をみたします。

・ 1 ≦ N ≦ 100
・ 1 ≦ a_i ≦ 100

入力例1
5
1 2 3 4 5

出力例1
2

入力例2
5
5 4 3 2 1

出力例2
6

入力例3
5
100 100 100 100 100

出力例3
101
=end