=begin
N が M ずつ増えたときにいつ K を越える？ (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/loop_problems2/loop_problems2__inc_m
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
整数 N, M, K が与えられます。
N が M ずつ増えるとき、何回目に K を越えるか出力してください。

▼　下記解答欄にコードを記入してみよう

入力される値
N M K


・ 1 行で整数 N, M, K が与えられます。

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
N が M ずつ増えるとき、何回目に K を越えるか出力してください。

条件
すべてのテストケースにおいて、以下の条件をみたします。

・ 1 ≦ N, M, K ≦ 1,000

入力例1
1 1 10

出力例1
10

入力例2
10 1 1

出力例2
0

入力例3
1 3 8

出力例3
3
=end