=begin
毎日増加するお金 (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/loop_problems2/loop_problems2__inc_percent
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
現在所持金を A 円持っています。
所持金が毎日 10% ずつ増えるとき、何日後に B 円を超えるか出力してください。
また、増加するお金は小数点以下切り捨てで考えることとします。
例として、所持金が 831 円 のとき、10% は 83.1円 ですが、増加するお金は 83 円 です。

▼　下記解答欄にコードを記入してみよう

入力される値
A B


・ 1 行で整数 A B が与えられます。

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
所持金が毎日 10% ずつ増えるとき、何日後に B 円を超えるか出力してください。

条件
すべてのテストケースにおいて、以下の条件をみたします。

・ 10 ≦ A ≦ B ≦ 10,000

入力例1
10 15

出力例1
6

入力例2
10 100

出力例2
29

入力例3
813 10000

出力例3
27
=end