=begin
未知数個の数の受け取り (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/loop_problems2/loop_problems2__unknown_int
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
長さがわからない数列 a が入力されます。
-1 が入力されるまで、受け取った数を改行区切りで出力してください。

▼　下記解答欄にコードを記入してみよう

入力される値
a_1 a_2 ... -1


・ 数列 a が 1 行で与えられます。

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
-1 が入力されるまで、受け取った数を改行区切りで出力してください。
出力の末尾には改行を入れてください。


a_1
a_2
...
-1
条件
すべてのテストケースにおいて、以下の条件をみたします。

・ 0 ≦ a_i ≦ 100 (1 ≦ i ≦ N)

入力例1
1 2 3 4 5 -1

出力例1
1
2
3
4
5
-1

入力例2
10 2 5 13 5 20 1 5 6 -1

出力例2
10
2
5
13
5
20
1
5
6
-1

入力例3
8 1 3 8 1 3 -1

出力例3
8
1
3
8
1
3
-1
=end