=begin
任意の数で何回割れる? (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/loop_problems2/loop_problems2__div_m
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
整数 N, M が与えられます。
N が何回 M で割れるかを求め、出力してください。

▼　下記解答欄にコードを記入してみよう

入力される値
N M


・ 1 行で整数 N, M が与えられます。

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
N が何回 M で割れるかを求め、出力してください。

条件
すべてのテストケースにおいて、以下の条件をみたします。

・ 1 ≦ N ≦ 100
・ 2 ≦ M ≦ 100

入力例1
4 2

出力例1
2

入力例2
16 8

出力例2
1

入力例3
81 3

出力例3
4
=end