=begin
  すごいリンゴ (paizaランク C 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/prime_number_primer_advanced/prime_number_primer_advanced__money_common
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
三人はそれぞれ A 円、B 円、C 円持っています。三人はそれぞれが持っている所持金でリンゴを買って、自分自身の持っている所持金を使い切りたいと思っています。

そのリンゴの値段が x 円であるとき、x の最大値を求めてください。

▼　下記解答欄にコードを記入してみよう

入力される値
・ 1 行目に整数 A B C が与えられます。


A B C

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
三人がそれぞれ所持金を使い切れるようなリンゴの値段の最大値を求め、一行で出力してください。

末尾に改行を入れ、余計な文字、空行を含んではいけません。

条件
すべてのテストケースにおいて、以下の条件をみたします。

・ 1 ≦ A, B, C ≦ 10,000

入力例1
1000 2000 3000

出力例1
1000

入力例2
150 270 900

出力例2
30

入力例3
1565 6548 1535

出力例3
1
=end
