=begin
数列の何番目にある? (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/loop_problems/loop_problems__seq_i-th
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
長さ N の数列 a (a_1, a_2, ..., a_N) が与えられます。
この数列の何番目に 1 があるか出力してください。
数列の 1 つ目の要素を 1 番目とし、数列には必ず 1 がひとつだけ含まれることとします。

▼　下記解答欄にコードを記入してみよう

入力される値
N
a_1 a_2 ... a_N


・ 1 行目に整数 N が与えられます。
・ 2 行目に長さ N の数列 a が与えられます。
・ 数列 a には必ず 1 がひとつだけ含まれる。

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
数列の何番目に 1 があるか出力してください。
出力の末尾には改行を入れてください。

条件
すべてのテストケースにおいて、以下の条件をみたします。

・ 1 ≦ N ≦ 100
・ 0 ≦ a_i ≦ 100 (1 ≦ i ≦ N)
・ 数列 a には必ず 1 がひとつだけ含まれる。

入力例1
5
5 4 3 2 1

出力例1
5

入力例2
5
5 1 4 3 2

出力例2
2

入力例3
6
8 2 3 8 1 3

出力例3
5
=end