#　10 行の出力 (paizaランク D 相当)
#　https://paiza.jp/works/mondai/stdout_primer/stdout_primer__newline_digit_step4

# 解答例1
ary = [813, 1, 2, 923874, 23648, 782356, 3256, 2342, 24324, 112]
# 出力
puts(ary)

# 解答例2
ary = [813, 1, 2, 923874, 23648, 782356, 3256, 2342, 24324, 112]
# 出力
ary.each do |n|
  puts(n)
end

# 解答例3
ary = [813, 1, 2, 923874, 23648, 782356, 3256, 2342, 24324, 112]
# 出力
0.upto(ary.length - 1).each do |i|
  puts(ary[i])
end

# 解答例4
ary = [813, 1, 2, 923874, 23648, 782356, 3256, 2342, 24324, 112]
# 出力
for i in 0..ary.length - 1
  puts(ary[i])
end

# NG 解答例
ary = [813, 1, 2, 923874, 23648, 782356, 3256, 2342, 24324, 112]
p(ary)

# 配列のまま表示される
# > [813, 1, 2, 923874, 23648, 782356, 3256, 2342, 24324, 112]
