# 【出力形式を指定して出力】ペアの数値の入った表を罫線入りで出力 2 (paizaランク C 相当)
# https://paiza.jp/works/mondai/stdout_primer/stdout_primer__specific_format_boss

# 入出力例
INPUT1 = <<~"EOS"
  2 3 7 8
EOS
OUTPUT1 = <<~"EOS"
  (________7,_________8)_|_(________7,_________8)_|_(________7,_________8)
  ========================================================================
  (________7,_________8)_|_(________7,_________8)_|_(________7,_________8)
EOS

INPUT2 = <<~"EOS"
  3 2 999999999 0
EOS
OUTPUT2 = <<~"EOS"
  (999999999,_________0)_|_(999999999,_________0)
  ===============================================
  (999999999,_________0)_|_(999999999,_________0)
  ===============================================
  (999999999,_________0)_|_(999999999,_________0)
EOS

# 解答例
# 入力
h, w, a, b = gets.split.map(&:to_i)
# 指定書式 (A, B) の文字列 s を生成
s = "(#{"%9d" % a}, #{"%9d" % b})"
# s を w 個 " | " で連結して末尾に改行を入れた文字列 line を生成
line = ([s] * w).join(" | ") + "\n"
# line を h 個 "=" * (25 * w - 3) で連結して
# 末尾に改行を追加した文字列 table を生成
# 22w + 3(w - 1) = 25w - 3
table = ([line] * h).join("=" * (25 * w - 3) + "\n")
# 出力
puts(table)
