# 【出力形式を指定して出力】ペアの数値の入った表を罫線入りで出力 2 (paizaランク C 相当)
# https://paiza.jp/works/mondai/stdout_primer/stdout_primer__specific_format_boss

# 入出力例
INPUT1 = <<~"EOS"
  2 3 7 8
EOS
OUTPUT1 = <<~"EOS"
  (        7,         8) | (        7,         8) | (        7,         8)
  ========================================================================
  (        7,         8) | (        7,         8) | (        7,         8)
EOS

INPUT2 = <<~"EOS"
  3 2 999999999 0
EOS
OUTPUT2 = <<~"EOS"
  (999999999,         0) | (999999999,         0)
  ===============================================
  (999999999,         0) | (999999999,         0)
  ===============================================
  (999999999,         0) | (999999999,         0)
EOS

# h, w, a, b = INPUT2.split.map(&:to_i); $> << ([(["(#{"%9d" % a}, #{"%9d" % b})"] * w).join(" | ") << "\n"] * h).join("=" * (w * 25 - 3) << "\n")

h, w, a, b = $<.read.split.map(&:to_i); $> << ([(["(#{"%9d" % a}, #{"%9d" % b})"] * w).join(" | ") << "\n"] * h).join("=" * (w * 25 - 3) << "\n")

# h,w,a,b=$<.read.split.map &:to_i;$><<([(["(#{"%9d"%a}, #{"%9d"%b})"]*w).join(" | ")<<"\n"]*h).join("="*(w*25-3)<<"\n")
