{-
半角スペース区切りの 3 つの入力 (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/stdin_primer/stdin_primer__split_input_step3
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
文字列 s_1, s_2, s_3 が半角スペースで区切られて 1 行で与えられます。
各文字列を出力するごとに改行し 3 行で出力してください。

▼　下記解答欄にコードを記入してみよう

入力される値
以下の形式で標準入力によって与えられます。
文字列 s_1, s_2, s_3 が半角スペースで区切られて 1 行で与えられます。


s_1 s_2 s_3

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
入力された文字列 s_1, s_2, s_3 をそれぞれ改行区切りで出力してください。
また、末尾に改行を入れ、余計な文字、空行を含んではいけません。


s_1
s_2
s_3
条件
すべてのテストケースにおいて、以下の条件をみたします。

・s_1, s_2, s_3 は数字または大文字・小文字のアルファベットからなる長さ 1 以上 10 以下の文字列

入力例1
good morning paiza

出力例1
good
morning
paiza

入力例2
8 1 3

出力例2
8
1
3

入力例3
hello world 813

出力例3
hello
world
813
-}