-- 100 行の整数の入力 (paizaランク D 相当)
-- https://paiza.jp/works/mondai/stdin_primer/stdin_primer__integer_row_step4

toInt :: String -> Int
toInt x = read x :: Int

toStr :: Int -> String
toStr x = show x :: String

main :: IO ()
main = do
  inputStr <- getContents

  let strNums = lines inputStr
  let intNums = map toInt strNums
  let outputStr = unlines $ map toStr intNums

  putStr outputStr

{-

main = do
    line <- getContents
    let num = map parseInt (lines line)
    putStr $ unlines $ map show num
    
parseInt :: String -> Int
parseInt x = read x :: Int


整数 a_1, a_2, ... , a_99, a_100 が 100 行で与えられるので a_1, a_2, ... , a_99, a_100 を 100 行で出力してください。

▼　下記解答欄にコードを記入してみよう

入力される値
以下の形式で標準入力によって与えられます。
整数 a_1, a_2, ... , a_99, a_100 が 100 行で与えられます。


a_1
a_2
...
a_99
a_100

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
a_1, a_2, ... , a_99, a_100 を 100 行で出力してください。
また、末尾に改行を入れ、余計な文字、空行を含んではいけません。


a_1
a_2
...
a_99
a_100
条件
すべてのテストケースにおいて、以下の条件をみたします。

・a_1, a_2, ... , a_99, a_100 は 1 以上 10,000 以下の整数

入力例1
4090
4199
9064
6517
9620
4155
5688
8290
819
8733
4409
556
6223
6231
6625
6413
2680
3673
7074
1685
1173
5231
79
1563
111
2777
258
1499
2293
8928
8159
939
4871
4535
5801
6821
6424
9405
5510
2836
9544
3251
5292
6832
7779
6457
87
5800
8807
6286
4921
5469
8405
8971
2315
4291
6946
991
4564
5922
8021
5101
8390
7023
7458
9225
8617
92
4249
4640
1314
2197
605
7658
7667
5680
9998
3050
5911
2892
9780
5342
692
6618
5590
2901
2113
1667
7247
8755
150
6878
9835
554
9970
7940
452
7535
9976
4574

出力例1
4090
4199
9064
6517
9620
4155
5688
8290
819
8733
4409
556
6223
6231
6625
6413
2680
3673
7074
1685
1173
5231
79
1563
111
2777
258
1499
2293
8928
8159
939
4871
4535
5801
6821
6424
9405
5510
2836
9544
3251
5292
6832
7779
6457
87
5800
8807
6286
4921
5469
8405
8971
2315
4291
6946
991
4564
5922
8021
5101
8390
7023
7458
9225
8617
92
4249
4640
1314
2197
605
7658
7667
5680
9998
3050
5911
2892
9780
5342
692
6618
5590
2901
2113
1667
7247
8755
150
6878
9835
554
9970
7940
452
7535
9976
4574
-}